ERP.belugaerp/src/DataProcessors/ПодборСерийВДокументы/ПодборСерийВДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПодборСерийВДокументы</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_СерияМарки</name>
      <comment>Разряд</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_НомерРулона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_НомерДиапазонаВРулоне</name>
      <comment>RangeNumberInRoll</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_НачальныйНомерДиапазона</name>
      <comment>Start</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_КонечныйНомерДиапазона</name>
      <comment>Last</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ERP.belugaerp/src/DataProcessors/ПодборСерийВДокументы/ManagerModule.bsl
&Вместо("НазванияЭлементовСерий")
Функция бг_НазванияЭлементовСерий(ИмяРеквизита)
	СтруктураВозврата = Новый Структура("Серии, ОстаткиСерий");
	
	Если ИмяРеквизита = "бг_СерияМарки"
		ИЛИ ИмяРеквизита = "бг_НомерРулона"
		ИЛИ ИмяРеквизита = "бг_НомерДиапазонаВРулоне"
		ИЛИ ИмяРеквизита = "бг_НачальныйНомерДиапазона"
		ИЛИ ИмяРеквизита = "бг_КонечныйНомерДиапазона"
		ИЛИ ИмяРеквизита = "бг_ЗаявлениеОВыдачеФСМ"
		ИЛИ ИмяРеквизита = "бг_НакладнаяНаВыдачуФСМ" Тогда
		
		Для каждого КлючЗначение из СтруктураВозврата Цикл
			СтруктураВозврата[КлючЗначение.Ключ] = СтрШаблон("%1%2", КлючЗначение.Ключ, ИмяРеквизита);
		КонецЦикла;
		
		Возврат СтруктураВозврата;
	Иначе	
		Возврат ПродолжитьВызов(ИмяРеквизита);
	КонецЕсли;
КонецФункции
